run/ghost/asymptotic_eqns/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    diffusionWall
    {
        type            fixedValue;
        value           nonuniform List<vector> 
50
(
(0.045108 0 0)
(0.135412 0 0)
(0.225974 0 0)
(0.316941 0 0)
(0.408427 0 0)
(0.500501 0 0)
(0.593177 0 0)
(0.686405 0 0)
...
);
    }

    symmetryWalls
    {
        type            symmetryPlane;
    }
    
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
